export default function CharaTxt(selected) {
    switch (selected) {
        case "Mamoru":
            return (
                <div style={{ fontSize: "14px" }}>
                    <p style={{ fontSize: "28px" }}>
                        『 ――全部が全部、気色が悪いよな…… 』<br />
                    </p>
                    <p >
                        本作の主人公である十九歳の青年。
                    </p>
                    <p >
                        舞台である繭ノ葉町を、実母と共に幼い頃に外へと連れ出た。
                    </p>
                    <p >
                        しかし母の消息不明を機に、十四年振りに町へと帰省することとなる。
                    </p>
                    <p >
                        無愛想気味だが本人なりには人を気遣おうとする故に、困る人などを放っておくことができない気質。
                    </p>
                    <p >
                        繭ノ葉町《御三家》の【神来社家】出自であり、長男ゆえ本来は当主を引き継ぐ立場であるのだが、
                    </p>
                    <p >
                        外の世界で育ったため実家への思い入れなどは何も無い。<br /><br />
                    </p>
                    <p >
                        キャラクター原画: ぎゃばん
                    </p>
                    <p >
                        キャラクター彩色: 麩幸地
                    </p>
                    <p >
                        キャラクターデザイン原案: 麻木ななみ
                    </p>
                </div>
            )
        case "Chiyo":
            return (
                <div style={{ fontSize: "14px" }}>
                    <p style={{ fontSize: "28px" }}>
                        『 町の外のこと、いっぱいウチに教えて欲しいんだぁ 』<br />
                    </p>
                    <p >
                        砂羽村三姉妹の次女。<br />
                    </p>
                    <p>
                        色々な事が気になったり、気に入らなかったりな年頃で悩みが尽きないらしい少女。
                    </p>
                    <p>
                        姉妹への愛情が強く、特に妹である樹里を溺愛している。
                    </p>
                    <p>
                        性への抵抗などは皆無。欲望には従順であり、興味津々ですらある。
                    </p>
                    <p>
                        町の外から訪れた守琉には、外の世界についての話をねだっては聞きため、交流を持ちたがってくる。<br /><br />
                    </p>
                    <p>
                        キャラクターデザイン・原画: よしな
                    </p>
                    <p>
                        キャラクター彩色: りりー
                    </p>
                </div>
            )
        case "Saika":
            return (
                <div style={{ fontSize: "14px" }}>
                    <p style={{ fontSize: "28px" }}>
                        『 まったく、アナタという人は……本当に…… 』<br />
                    </p>
                    砂羽村三姉妹の長女。<br />
                    旅館である 孵縲不ノ館 -かえらずのやかた- では女将を務めている。<br />
                    旅館の若旦那である司斗羅栖とは夫婦関係であるが、業務以上の感情は非常に薄い。<br />
                    妹である千代を溺愛しているのだが、その想いは……？<br />
                    本当は女将の仕事も性に合っておらず、妹たちのためと日々を自分に向かないコトへ勤しんでは、<br />
                    心を徐々にと擦り減らし続けている。<br />
                    キャラクターデザイン・原画: りりー<br />
                    キャラクター彩色: 夏紀ゆう<br />
                </div>
            )
        case "Juri":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 ねえさまたちは、ジュリの誇りなのですっ！ 』<br />
                    砂羽村三姉妹の末女。<br />
                    姉たちのことを心から慕い、その助けになりたいと日々を働く姉たちの手伝いをかって出ている頑張り屋。<br />
                    性経験は皆無だが性へ関する羞恥心なども無く、異性を悦ばせられるが為の行いだと捉えている。<br />
                    その独特な倫理観ゆえに、とても危うい純粋さを持つが……。<br />
                    見た目の幼さのわりに丁寧な言葉遣いをするが、容姿や知識が実年齢にあまり追いついてはいない。<br />
                    キャラクターデザイン・原画: 遥<br />
                    キャラクター彩色: りりー
                </p>
            )
        case "Tsuyuri":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 ワタクシと、そちらさま。きっとご縁がありますわよ 』<br />
                    慰安のためと繭ノ葉町を訪れ、守琉と同じ旅館へと宿泊しに来ている女性。<br />
                    正体はその声を知る人が聴けば判るほど、有名なラヂオ女優である。<br />
                    本人いわく《勘》がとにかく良いらしく、何かと守琉に対して協力的な態度をとる。<br />
                    髪は自前で染めている。<br />
                    キャラクターデザイン・原画: あるぷすよ<br />
                    キャラクター彩色:<br />
                </p>
            )
        case "Nazuna":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 むっ。なずなは立派に、コチラの使用人ですよ！ 』<br />
                    繭ノ葉町《御三家》の一つ、【梅園家】に就く使用人。<br />
                    当主や若旦那の世話役をしているが、他の男性に対しては一歩、二歩をも退いた態度をとる。<br />
                    間が抜けており、使用人としては心許ない働きをしていることで、周りからはその都度に呆れられている様子。<br />
                    当主である梅園聡晟にたいしては、とてつもない心酔と依存心を見せている。<br />
                    キャラクターデザイン・原画: たまも<br />
                    キャラクター彩色: くれは<br />
                </p>
            )
        case "Sousei":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 ようこそ来てくれたね。……待っていたんだよ 』<br />
                    繭ノ葉町《御三家》の一つ、【梅園家】現当主であり、繭ノ葉の町長を務める。<br />
                    町に関し絶大な権力を持つが、力に反したかのよう本人は温厚でとても物腰柔らかい態度をとる。<br />
                    身体が弱いようで、定期的に医師である久留島健治に診てもらっている。<br />
                    守琉の立場や環境を、程度に察しているかのようである。<br />
                    キャラクターデザイン・原画: 澪<br />
                    キャラクター彩色: ゆりねりあ<br />
                </p>
            )
        case "Shitorasu":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 いやはや、――守琉クンに興味が尽きないね 』<br />
                    旅館《孵縲不ノ館》を経営する若旦那。常に飄々としており、笑顔を絶やさない。<br />
                    女将である才花とは夫婦関係のはずであるが、業務以上の付き合いが薄い。<br />
                    とても美形であり言い寄ってくる女性が多いが、本人は来るもの拒まず去るもの追わずで受け入れ、関係を持っている。<br />
                    守琉には何故か非常に好意的で、やけに絡んでくることが多く、ナニカを見抜くような発言をすることがある。<br />
                    キャラクターデザイン: よもぎ<br />
                    キャラクター原画: 麻木ななみ<br />
                    キャラクター彩色: はくがん<br />
                </p>
            )
        case "Ryuko":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 きっとこれは……私たちオトナへの〝ノロイ〟なのでしょうね…… 』<br />
                    旅館《孵縲不ノ館》で主に清掃、調理の担当をしている使用人の女性。<br />
                    使用人とは思えぬほどの上品さを持って人と接しているが、なにかと幸薄さのせいか苦労が見える。<br />
                    町に残る風習や信仰に対して極度に怯えている節がある。<br />
                    キャラクターデザイン・原画: 麩幸地<br />
                    キャラクター彩色:<br />
                    キャラクターデザイン原案: 夏紀ゆう<br />
                </p>
            )
        case "Ryou":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 アンタにそこ居られると、コッチは仕事にならねぇんだよ 』<br />
                    旅館《孵縲不ノ館》で主に庭の手入れ、工具管理などの担当をしている使用人の男性。<br />
                    使用人とは思えぬほど無愛想な態度をとるが、同じ使用人立場である なずなや流子には気を遣ったり、突っ込みをこなしたりする。<br />
                    とくに間の抜けた なずなとのやり取りは、しばし漫才のようである。<br />
                    キャラクターデザイン・原画: 麩幸地<br />
                    キャラクター彩色:<br />
                </p>
            )
        case "Kenji":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 非現実的な事柄は受け入れることが難しい……しかし…… 』<br />
                    繭ノ葉町で診療所を経営する医師であり、《御三家》の一つ【久留島家】現当主。<br />
                    聡晟の訪問診療のため、度々と梅園家へ通っている。かつては梅園家の家庭教師も務めていたほど親交が深い。<br />
                    高身長なせいか一見は威圧的に、態度も無愛想にも見えるのだが、そう見られてしまうことを本人は少し気にしている模様。<br />
                    キャラクターデザイン・原画: 麩幸地<br />
                    キャラクター彩色: 麩幸地<br />
                </p>
            )
        case "Komari":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 ――そちの名を、識ってるぞ 』<br />
                    繭ノ葉町で出会う、巫女のような狩り衣姿の童女。<br />
                    何かと言葉を投げかけてくるが、内容は非現実的で要領も得ないものである。<br />
                    守琉を度々と気にかけ、守琉も童女にどこか母の面影を見ることとなるが……。<br />
                    キャラクターデザイン・原画: 麻木ななみ<br />
                    キャラクター彩色:<br />
                </p>
            )
        case "Ushio":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 ？　お昼ってどんぶりなの？ 』<br />
                    双子の姉。<br />
                    どんくさそうな方のうし乳。<br />
                    八遠寺れすなの下僕である。<br />
                    キャラクターデザイン・原画: 夏紀ゆう<br />
                    キャラクター彩色: 麩幸地<br />
                </p>
            )
        case "Umino":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 はえ～ひとつ賢くなれたねえ 』<br />
                    双子の妹。<br />
                    キャピキャピとしてる方のうし乳。<br />
                    八遠寺れすなの下僕である。<br />
                    キャラクターデザイン・原画: Унитаз<br />
                    キャラクター彩色: 麩幸地<br />
                </p>
            )
        case "Resuna":
            return (
                <p style={{ fontSize: "14px" }}>
                    『 ごめんなさいな。私、ヒトを驚かせるのが好きなものでして 』<br />
                    繭ノ葉町に存在する娼館《翅爾蝶館》の女主人。<br />
                    下僕の女の子を二人連れては、オモチャとして弄っている。<br />
                    面白いことを見つけたがり、つまらないことを嫌う。<br />
                    何かを見透し、何かを語るが、その真意は誰にも判らず、視えもしない。<br />
                    キャラクターデザイン・原画: はくがん<br />
                    キャラクター彩色: 夏紀ゆう<br />
                </p>
            )
    }
}
