export default function CharaTxt(selected) {
  switch (selected) {
    case "Mamoru":
      return (
        <div>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 ――全部が全部、気色が悪いよな…… 』<br />
          </p>
          <p>
            本作の主人公である十九歳の青年。
            <br />
            舞台である繭ノ葉町を、実母と共に幼い頃に外へと連れ出た。
            <br />
            しかし母の消息不明を機に、十四年振りに町へと帰郷することとなる。
            <br />
            無愛想気味だが本人なりには人を気遣おうとする故に、困る人などを放っておくことができない。
            <br />
            繭ノ葉町-御三家-
            《神来社家》の出自であり、長男ゆえ本来は当主を引き継ぐ立場であるのだが、
            外の世界で育ったため本家への思い入れなどは何も無い。
            <br />
          </p>
          <p>
            キャラクター原画: ぎゃばん
            <br />
            キャラクター彩色: 麩幸地
            <br />
            キャラクターデザイン原案: 麻木ななみ
          </p>
        </div>
      );
    case "Chiyo":
      return (
        <div>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 町の外のこと、いっぱいウチに教えて欲しいんだぁ 』<br />
          </p>
          <p>
            砂羽村三姉妹の次女。
            <br />
            色々なコトが気になったり、気に入らなかったりな年頃で悩みが尽きないらしい少女。
            <br />
            姉妹への愛情が強く、特に妹である樹里を溺愛している。
            <br />
            性への抵抗などは皆無。欲望には従順であり、興味津々ですらある。
            <br />
            町の外から訪れた守琉には、外の世界についての話をねだっては聞くためにと、交流を持ちたがってくる。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: よしな
            <br />
            キャラクター彩色: りりー
          </p>
        </div>
      );
    case "Saika":
      return (
        <div>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 まったく、アナタという人は……本当に…… 』<br />
          </p>
          <p>
            砂羽村三姉妹の長女。
            <br />
            旅館である 孵縲不ノ館 -かえらずのやかた- では女将を務めている。
            <br />
            旅館の若旦那である司斗羅栖とは夫婦の関係であるが、業務以上の感情は非常に薄い。
            <br />
            妹である千代を溺愛しているのだが、その想いは……？
            <br />
            本来は女将の仕事も性に合っておらず、妹たちのためと日々を自分に向かないコトへ勤しんでは、
            心を徐々にと擦り減らし続けている。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: りりー
            <br />
            キャラクター彩色: 夏紀ゆう
            <br />
          </p>
        </div>
      );
    case "Juri":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 ねえさまたちは、ジュリの〝タカラモノ〟なのですっ！ 』<br />
          </p>
          <p>
            砂羽村三姉妹の末女。
            <br />
            姉たちのことを心から慕い、その助けになりたいと、日々を働く姉たちの手伝いをかって出ている頑張り屋。
            <br />
            性経験は皆無だが性へ関する羞恥心なども無く、異性を悦ばせられるが為の行いだと捉えている。
            <br />
            その独特な倫理観ゆえに、とても危うい純粋さを持つが……。
            <br />
            見た目の幼さのわりに丁寧な言葉遣いをするが、容姿や知識が実年齢にあまり追いついてはいない。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 遥<br />
            キャラクター彩色: りりー
          </p>
        </p>
      );
    case "Tsuyuri":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 ワタクシと、そちらさま。きっとご縁がありますわよ 』<br />
          </p>
          <p>
            慰安にと繭ノ葉町を訪れ、孵縲不ノ館 -かえらずのやかた-
            へ宿泊をする断髪の女性。
            <br />
            正体はその声を識る人が聴けば判るほどの、有名なラヂオ女優である。
            <br />
            本人いわく -勘- がとにかく良いらしく、自身のその -勘- に従ってか
            守琉に対して、なにかと友好的、協力的な態度をとってくる。
            <br />
            美しさを感じさせるような名前は作り名。煌びやかな頭髪も自身で染めているようである。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: あるぷすよ
            <br />
            キャラクター彩色: くれは
            <br />
          </p>
        </p>
      );
    case "Nazuna":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 むっ……。〝なずな〟はちゃんと、お屋敷の使用人ですよっ！ 』
          </p>
          <p>
            繭ノ葉町-御三家-の一つ、《梅園家》に就く女中。
            <br />
            当主やその子息の身回り世話をしているが、他の男性に対しては一歩、二歩をと退いた態度をとる。
            <br />
            なにかと間が抜けており、使用人として心許ない働きをしてしまうことで
            周りなどからは、その都度に呆れられている様子。
            <br />
            現当主である梅園聡晟には異常なほどの依存心を持ち、彼の言葉には絶対とまで心酔している。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: たまも
            <br />
            キャラクター彩色: くれは
            <br />
          </p>
        </p>
      );
    case "Sousei":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 ようこそ来てくれたね。……待っていたんだよ 』
          </p>
          <p>
            繭ノ葉町-御三家-の一つ、《梅園家》現当主であり、繭ノ葉の町長を務める。
            <br />
            町に関し絶大な権力を持つが、力に反したかのよう本人は温厚。とても物腰柔らかい態度をとる。
            <br />
            身体が弱いようで、定期的に医師である久留島健治に診てもらっている。
            <br />
            守琉の立場や環境を、程度に察しているかのようである。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 澪<br />
            キャラクター彩色: UUY
            <br />
          </p>
        </p>
      );
    case "Shitorasu":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 いやはや、――守琉クンに興味が尽きないね 』
          </p>
          <p>
            旅館である 孵縲不ノ館 -かえらずのやかた- を経営する若旦那。
            <br />
            常に態度は飄々としており、笑顔を絶やさない。
            <br />
            旅館女将である才花とは夫婦関係のはずであるが、業務以上の付き合いが薄い。
            <br />
            整った顔立ちであり言い寄ってくる女性が多く、
            本人は来るもの拒まず、去るもの追わずで受け入れては関係を持っている、いわば遊び人。
            <br />
            守琉には何故か非常に好意的で、やけに絡んでくることが多く、ナニカを見抜くような発言をすることがある。
          </p>
          <p>
            キャラクターデザイン: よもぎ
            <br />
            キャラクター原画: 麻木ななみ
            <br />
            キャラクター彩色: はくがん
            <br />
          </p>
        </p>
      );
    case "Ryuko":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 きっとこれは私たちオトナへの……〝ノロイ〟なのでしょうね…… 』
          </p>
          <p>
            旅館である 孵縲不ノ館 -かえらずのやかた-
            で主に清掃、調理の係をしている使用人の女性。
            <br />
            使用人とは思えぬほどの上品さを持って人と接しているが、なにかと幸薄さのせいか苦労が見える。
            <br />
            町の中に残る風習や信仰に対して、極度に怯えている節があるようで……。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 麩幸地
            <br />
            キャラクター彩色: くれは
            <br />
            キャラクターデザイン原案: 夏紀ゆう
            <br />
          </p>
        </p>
      );
    case "Ryou":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 アンタにそこ居られると、コッチは仕事にならねぇんだよ 』<br />
          </p>
          <p>
            旅館である 孵縲不ノ館 -かえらずのやかた-
            で主に庭の手入れ、工具管理などの係をしている使用人の男性。
            <br />
            使用人とは思えぬほど無愛想な態度をとるが、
            同じ使用人立場である淡嶋なずなや、折戸流子には気を遣ったり、突っ込みをこなしたりする。
            <br />
            とくに間の抜けた なずなとのやり取りは、しばし漫才のようである。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 麩幸地
            <br />
            キャラクター彩色: くれは
            <br />
          </p>
        </p>
      );
    case "Kenji":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 非現実的な事柄は受け入れることが難しい。……しかし 』
          </p>
          <p>
            繭ノ葉町で診療所を経営する医師であり、繭ノ葉町-御三家-の一つ《久留島家》現当主。
            <br />
            聡晟の訪問診療のため、度々と《梅園家》へ通っている。
            <br />
            かつては《梅園家》の専属家庭教師も務めていたほど、親交も深い。
            <br />
            高身長なせいか一見は威圧的に、態度も無愛想にも見えるのだが、
            そう見られてしまうことを本人は少し気にしている模様。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 麩幸地
            <br />
            キャラクター彩色: 麩幸地
            <br />
          </p>
        </p>
      );
    case "Komari":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 ――そちの名を、識ってるぞ 』<br />
          </p>
          <p>
            守琉が繭ノ葉町で出会う、巫女のような狩り衣姿の童女。
            <br />
            懐かれたようで何かと言葉を投げかけてくるが、内容は非現実的で、要領も得ないものである。
            <br />
            守琉のことを度々と気にかけ、守琉自身も童女にどこか母親の面影を見ることとなるようだが……。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 麻木ななみ
            <br />
            キャラクター彩色: りりー
            <br />
          </p>
        </p>
      );
    case "Ushio":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 ？　お昼ってどんぶりなの？ 』<br />
          </p>
          <p>
            双子の姉。
            <br />
            どんくさそうな方のうし乳。
            <br />
            燠津洲ひがねの下僕である。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 夏紀ゆう
            <br />
            キャラクター彩色: 麩幸地
            <br />
          </p>
        </p>
      );
    case "Umino":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 はえ～ひとつ賢くなれたねえ 』<br />
          </p>
          <p>
            双子の妹。
            <br />
            キャピキャピとしてる方のうし乳。
            <br />
            燠津洲ひがねの下僕である。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: Унитаз
            <br />
            キャラクター彩色: 麩幸地
            <br />
          </p>
        </p>
      );
    case "Higane":
      return (
        <p>
          <p style={{ fontSize: "20px", fontWeight: "bold" }}>
            『 申し訳ありませんわ。私、ヒトを驚かせるのが好きなものでして 』
            <br />
          </p>
          <p>
            繭ノ葉町に存在する娼館　翅爾蝶館 -ぎじちょうかん- のオンナ主人。
            <br />
            下僕として女子を二人連れては、度々にオモチャとして弄っている。
            <br />
            守琉へは戯れるようにナニカを語るが、その真意は不明。
            <br />
          </p>
          <p>
            キャラクターデザイン・原画: 夏紀ゆう
            <br />
            キャラクター彩色: 夏紀ゆう
            <br />
          </p>
        </p>
      );
  }
}
